app/Controllers/admin/Programme.php

SELECT *
FROM `dsh2_programme`
ORDER BY `id` ASC
---
    public function index(): string
    {
        $dataArr = array();
        $dataArr['pageTitle'] = "Manage Programmes";
        $dataArr['menu'] = "Programme";
        $dataArr['subMenu'] = "List";
        $dataArr['viewPage'] = 'admin/programme/list';

        $sessionData = session()->get('user');

        $programmeModel = new ProgrammeModel();

        //$colleges = $collegeModel->where('location', $location)->findAll();
        $dataArr['programmes'] = $programmeModel->orderBy('id', 'asc')->findAll();

SELECT *
FROM `dsh2_programme`
WHERE `id` = '2'
---
    public function edit(): string
    {
        $dataArr = array();
        $dataArr['pageTitle'] = "Manage Programmes";
        $dataArr['menu'] = "Programme";
        $dataArr['subMenu'] = "edit";
        $dataArr['viewPage'] = 'admin/programme/edit';

        $sessionData = session()->get('user');
        $programmeId = $this->request->getPost('programme_id');

        $programmeModel = new ProgrammeModel();
        $dataArr['programmeDetails'] = $programmeModel->where('id', $programmeId)->findAll()[0];

UPDATE `dsh2_programme` SET `type` = '1', `name` = 'Bachelor of Comm', `position` = '2', `created_by` = 1
WHERE `dsh2_programme`.`id` IN ('3')
---


                //$programmeAdded = $programmeModel->update($userData, ['programme_id' => $programmeId]);
                $programmeAdded = $programmeModel->update($programmeId, $userData);